AA-CubeSat-Team/soci_cdh_rtos/cdh_peripherals_test/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_B1_02 (coord L11), SPDIF_OUT/J22[7] */
#define BOARD_INITPINS_SPDIF_OUT_PERIPHERAL                              LPUART2   /*!< Device name: LPUART2 */
#define BOARD_INITPINS_SPDIF_OUT_SIGNAL                                       TX   /*!< LPUART2 signal: TX */

/* GPIO_AD_B1_03 (coord M12), SPDIF_IN/J22[8] */
#define BOARD_INITPINS_SPDIF_IN_PERIPHERAL                               LPUART2   /*!< Device name: LPUART2 */
#define BOARD_INITPINS_SPDIF_IN_SIGNAL                                        RX   /*!< LPUART2 signal: RX */

/* GPIO_AD_B1_06 (coord J12), CSI_VSYNC/J35[18]/J22[2]/UART_TX */
#define BOARD_INITPINS_CSI_VSYNC_PERIPHERAL                              LPUART3   /*!< Device name: LPUART3 */
#define BOARD_INITPINS_CSI_VSYNC_SIGNAL                                       TX   /*!< LPUART3 signal: TX */

/* GPIO_AD_B1_07 (coord K10), CSI_HSYNC/J35[16]/J22[1]/UART_RX */
#define BOARD_INITPINS_CSI_HSYNC_PERIPHERAL                              LPUART3   /*!< Device name: LPUART3 */
#define BOARD_INITPINS_CSI_HSYNC_SIGNAL                                       RX   /*!< LPUART3 signal: RX */

/* GPIO_AD_B1_11 (coord J13), SAI1_RX_BCLK/CSI_D6/J35[7]/J23[2] */
#define BOARD_INITPINS_CSI_D6_PERIPHERAL                                 LPUART8   /*!< Device name: LPUART8 */
#define BOARD_INITPINS_CSI_D6_SIGNAL                                          RX   /*!< LPUART8 signal: RX */

/* GPIO_AD_B1_10 (coord L13), SAI1_RX_SYNC/CSI_D7/J35[9]/J23[1] */
#define BOARD_INITPINS_CSI_D7_PERIPHERAL                                 LPUART8   /*!< Device name: LPUART8 */
#define BOARD_INITPINS_CSI_D7_SIGNAL                                          TX   /*!< LPUART8 signal: TX */

/* GPIO_B0_04 (coord C8), LCDIF_D0/BT_CFG[0] */
#define BOARD_INITPINS_LCDIF_D0_PERIPHERAL                                LPI2C2   /*!< Device name: LPI2C2 */
#define BOARD_INITPINS_LCDIF_D0_SIGNAL                                       SCL   /*!< LPI2C2 signal: SCL */

/* GPIO_B0_05 (coord B8), LCDIF_D1/BT_CFG[1] */
#define BOARD_INITPINS_LCDIF_D1_PERIPHERAL                                LPI2C2   /*!< Device name: LPI2C2 */
#define BOARD_INITPINS_LCDIF_D1_SIGNAL                                       SDA   /*!< LPI2C2 signal: SDA */

/* GPIO_AD_B0_04 (coord F11), CSI_PWDN/J35[17]/BOOT_MODE[0] */
#define BOARD_INITPINS_CSI_PWDN_PERIPHERAL                                LPSPI3   /*!< Device name: LPSPI3 */
#define BOARD_INITPINS_CSI_PWDN_SIGNAL                                      PCS1   /*!< LPSPI3 signal: PCS1 */

/* GPIO_AD_B0_05 (coord G14), CAN_STBY/BOOT_MODE[1]/Flash_RST/U12[8] */
#define BOARD_INITPINS_CAN_STBY_PERIPHERAL                                LPSPI3   /*!< Device name: LPSPI3 */
#define BOARD_INITPINS_CAN_STBY_SIGNAL                                      PCS2   /*!< LPSPI3 signal: PCS2 */

/* GPIO_SD_B0_01 (coord J3), SD1_CLK/J24[3] */
#define BOARD_INITPINS_SD1_CLK_PERIPHERAL                                 LPI2C3   /*!< Device name: LPI2C3 */
#define BOARD_INITPINS_SD1_CLK_SIGNAL                                        SDA   /*!< LPI2C3 signal: SDA */

/* GPIO_SD_B0_00 (coord J4), SD1_CMD/J24[6] */
#define BOARD_INITPINS_SD1_CMD_PERIPHERAL                                 LPI2C3   /*!< Device name: LPI2C3 */
#define BOARD_INITPINS_SD1_CMD_SIGNAL                                        SCL   /*!< LPI2C3 signal: SCL */

/* GPIO_B0_00 (coord D7), LCDIF_CLK */
#define BOARD_INITPINS_LCDIF_CLK_GPIO                                      GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_LCDIF_CLK_PORT                                      GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_LCDIF_CLK_PIN                                          0U   /*!< GPIO2 pin index: 0 */

/* GPIO_B0_01 (coord E7), LCDIF_ENABLE */
#define BOARD_INITPINS_LCDIF_ENABLE_GPIO                                   GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_LCDIF_ENABLE_PORT                                   GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_LCDIF_ENABLE_PIN                                       1U   /*!< GPIO2 pin index: 1 */

/* GPIO_B0_02 (coord E8), LCDIF_HSYNC */
#define BOARD_INITPINS_LCDIF_HSYNC_GPIO                                    GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_LCDIF_HSYNC_PORT                                    GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_LCDIF_HSYNC_PIN                                        2U   /*!< GPIO2 pin index: 2 */

/* GPIO_B0_03 (coord D8), LCDIF_VSYNC */
#define BOARD_INITPINS_LCDIF_VSYNC_GPIO                                    GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_LCDIF_VSYNC_PORT                                    GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_LCDIF_VSYNC_PIN                                        3U   /*!< GPIO2 pin index: 3 */

